---
kind: method
id: M:Autodesk.Revit.DB.CitySet.GetEnumerator
source: html/8db96fb0-872d-0617-e208-47f5e37bc12c.htm
---
# Autodesk.Revit.DB.CitySet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.